config.org
#+title Clownway Emacs
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

* Introduction
This is John Conway's Emacs configuration (mostly stolen from Runemacs).
Started: 12/20/2018
Last Update: 07/12/2021

** For Windows Taskbar Pinning
1. Run Emacs
2. Pin icon to taskbar
3. Right click icon -> right click Emacs -> properties -> point to runemacs.exe
   
* General Settings
** Basic Functionality
#+begin_src emacs-lisp 
(setq inhibit-startup-message t)
(setq confirm-kill-emacs 'yes-or-no-p)
(setq make-backup-files nil)
(setq auto-save-default nil)
(setq ring-bell-function 'ignore) ;; SHUT UP
(set-language-environment "UTF-8")
#+end_src

** UI
*** Fullscreen Mode
#+begin_src emacs-lisp 
(setq ns-use-native-fullscreen t)
(set-frame-parameter nil 'fullscreen 'fullboth)
#+end_src

*** Menus and Bars
#+begin_src emacs-lisp 
(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)
(set-fringe-mode 5)
(menu-bar-mode -1)
(add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
(add-to-list 'default-frame-alist '(ns-appearance . dark))
(setq ns-use-proxy-icon  nil)
(setq frame-title-format nil)
#+end_src

*** Parenthesis Mode
#+begin_src emacs-lisp 
(setq show-paren-delay 0)
(show-paren-mode 1)
#+end_src

*** Line Numbers Mode
#+begin_src emacs-lisp 
(global-display-line-numbers-mode t)
;; exceptional modes
(dolist (mode '(org-mode-hook
		term-mode-hook
		eshell-mode-hook
		shell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

*** Font
#+begin_src emacs-lisp 
(set-face-attribute 'default nil :font "Mononoki" :height 125)
#+end_src

*** Theme
#+begin_src emacs-lisp
(use-package doom-themes
  :config
  (load-theme 'doom-dark+ t))
#+end_src

** Babel
#+begin_src emacs-lisp 
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)))

(with-eval-after-load 'org
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python")))
#+end_src

*** Auto-Tangle Configuration Files
#+begin_src emacs-lisp
(defun efs/org-babel-tangle-config ()
  (when (string-equal (file-name-directory (buffer-file-name))
                      (expand-file-name user-emacs-directory))
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))
#+end_src

* Package Management
#+begin_src emacs-lisp
(require 'package)
(setq package-enable-at-startup nil)
(setq package-archives '(("org"   . "http://orgmode.org/elpa/")
                         ("gnu"   . "http://elpa.gnu.org/packages/")
                         ("melpa" . "https://melpa.org/packages/")))
(package-initialize)

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(require 'use-package)
(setq use-package-always-ensure 't)
#+end_src

* Packages
** General
*** Helm
#+begin_src emacs-lisp
(use-package helm
  :init
  (setq helm-M-x-fuzzy-match t
	helm-mode-fuzzy-match t
	helm-buffers-fuzzy-matching t
	helm-recentf-fuzzy-match t
	helm-locate-fuzzy-match t
	helm-semantic-fuzzy-match t
	helm-imenu-fuzzy-match t
	helm-completion-in-region-fuzzy-match t
	helm-candidate-number-list 150
	helm-split-window-inside-p t
	helm-move-to-line-cycle-in-source t
	helm-echo-input-in-header-line t
	helm-autoresize-max-height 0
	helm-autoresize-min-height 20)
  :config
  (helm-mode t))
#+end_src

*** Projectile
#+begin_src emacs-lisp
(use-package projectile
  :config
  (projectile-mode t))
#+end_src

*** Helm-Projectile
#+begin_src emacs-lisp
(use-package helm-projectile
  :init
  (setq helm-projectile-fuzzy-match t)
  :config
  (helm-projectile-on))
#+end_src

*** All The Icons
#+begin_src emacs-lisp
(use-package all-the-icons)
(unless (member "all-the-icons" (font-family-list))
  (all-the-icons-install-fonts t))
#+end_src

*** Magit
#+begin_src emacs-lisp
(use-package magit
  :bind
  (("C-c m m" . magit)))
#+end_src

*** Flycheck
#+begin_src emacs-lisp
(use-package flycheck)
#+end_src

*** Beacon
#+begin_src emacs-lisp
(use-package beacon
  :init
  (beacon-mode t))
#+end_src

*** Company
#+begin_src emacs-lisp
(use-package company)
#+end_src

*** Dimmer
#+begin_src emacs-lisp
(use-package dimmer
  :init
  (dimmer-mode))
#+end_src

*** Which Key
#+begin_src emacs-lisp
(use-package which-key
  :init (which-key-mode)
  :diminish (which-key-mode)
  :config
  (setq which-key-idle-delay 0.3))
#+end_src

*** Spaceline
#+begin_src emacs-lisp
(use-package spaceline
  :init
  (spaceline-helm-mode))
(use-package spaceline-all-the-icons
  :after spaceline
  :config (spaceline-all-the-icons-theme))
#+end_src

*** Shell-Pop
#+begin_src emacs-lisp
(use-package shell-pop
  :config
  (defcustom shell-pop-cleanup-buffer-at-process-exit t
  "If non-nil, cleanup the shell's buffer after its process exits.")
  (defun shell-pop--set-exit-action ()
  (if (string= shell-pop-internal-mode "eshell")
      (add-hook 'eshell-exit-hook 'shell-pop--kill-and-delete-window nil t)
    (let ((process (get-buffer-process (current-buffer))))
      (when process
        (set-process-sentinel
         process
         (lambda (_proc change)
           (when (string-match-p "\\(?:finished\\|exited\\)" change)
	     (run-hooks 'shell-pop-process-exit-hook)
             (when shell-pop-cleanup-buffer-at-process-exit
               (kill-buffer))
             (if (one-window-p)
                 (switch-to-buffer shell-pop-last-buffer)
               (delete-window))))))))))
(push (cons "\\*shell\\*" display-buffer--same-window-action) display-buffer-alist)
(global-set-key (read-kbd-macro "C-c t") 'shell-pop)
#+end_src

*** Exec Path From Shell
#+begin_src emacs-lisp
(use-package exec-path-from-shell)
(when (memq window-system '(mac ns x))
  (exec-path-from-shell-initialize))
#+end_src

*** Rainbow Delimiters
#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** Org Mode
*** Settings
#+begin_src emacs-lisp
(defun org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode t)
  (auto-fill-mode 0)
  (visual-line-mode t))
#+end_src

*** Symbols
#+begin_src emacs-lisp
(use-package org
  :hook (org-mode . org-mode-setup)
  :config
  (setq org-ellipsis " ↴↴↴"
	org-hide-emphasis-markers t))
#+end_src

*** Bullets
#+begin_src emacs-lisp
(use-package org-bullets
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

(font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
#+end_src

*** Faces
#+begin_src emacs-lisp
(with-eval-after-load 'org-faces 
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "Mononoki" :weight 'regular :height (cdr face))))
#+end_src

*** Preserve Indentation
#+begin_src emacs-lisp
(setq org-src-preserve-indentation t)
#+end_src

** Languages

* Keybinds
#+begin_src emacs-lisp
(use-package general
  :config
  (general-define-key
   ;; Buffers
   "C-c v" '(split-window-below :which-key "split buffer down")
   "C-c r" '(split-window-right :which-key "split buffer right")
   "C-c l"  '(helm-buffers-list :which-key "buffers list")
   ;; Windows
   "C-c f" '(windmove-right :which-key "move right")
   "C-c b" '(windmove-left :which-key "move left")
   "C-c p" '(windmove-up :which-key "move up")
   "C-c n" '(windmove-down :which-key "move down")
   "C-c k" '(delete-window :which-key "delete window")
   ;; Goto
   "C-c g" '(goto-line :which-key "goto line")
   ;; Quit
   "<escape>" 'keyboard-escape-quit
   ;; Helm
   "C-c m p r"  '(helm-show-kill-ring :which-key "show kill ring")
   "M-x" 'helm-M-x
   "C-c m f " '(helm-find-files :which-key "helm find files")
   ;; Projectile
   "C-c m p f" '(projectile-find-file :which-key "projectile find file")
   ;; Beacon
   "C-'" '(beacon-blink :which-key "blink beacon")
   ;; General Compiling
   "C-c m c" '(compile :which-key "general compile")
   "C-c m r" '(recompile :which-key "general recompile")
   ))
#+end_src
